app/controllers/pages_controller.rb

  def index
    @users = User.all.paginate :page => params[:page], :per_page => 5
---
SELECT  "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]