app/controllers/prodacts_controller.rb

SELECT  "prodacts".* FROM "prodacts" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    @prodacts_all = Prodact.paginate :page => params[:page], :per_page => 5

INSERT INTO "prodacts" ("name", "decription", "price", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "a"], ["decription", "hiii"], ["price", "1234.0"], ["quantity", 12], ["created_at", "2017-08-25 11:56:14.489628"], ["updated_at", "2017-08-25 11:56:14.489628"]]
---
  def create
    @prodact = Prodact.new(prodact_params)
    respond_to do |format|
      if @prodact.save

SELECT  "prodacts".* FROM "prodacts" WHERE "prodacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_prodact
      @prodact = Prodact.find(params[:id])